#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.auth: Refreshing state... [id=none]
data.aws_caller_identity.current: Reading...
aws_vpc.this: Refreshing state... [id=vpc-01de06becdba1d3e3]
aws_kms_key.encryption_secret: Refreshing state... [id=f85a88f9-9111-46ea-b982-eac7d746d5b4]
data.aws_availability_zones.available: Reading...
data.aws_ami.amazon_ami: Reading...
aws_iam_role.ec2_role: Refreshing state... [id=app-4-ec2-role]
aws_kms_key.encryption_rest: Refreshing state... [id=624af10a-9d39-4f81-ad00-09dd8d439885]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-4-ec2-role-20231211171356953100000002]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=app-4-ec2-profile]
aws_kms_alias.encryption_secret: Refreshing state... [id=alias/elasticache-app-4-in-transit]
aws_secretsmanager_secret.elasticache_auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-4-elasticache-auth-wx4d1f]
aws_cloudwatch_log_group.engine_log: Refreshing state... [id=/elasticache/app-4-redis-cluster/engine-log]
aws_kms_key_policy.encryption_rest_policy: Refreshing state... [id=624af10a-9d39-4f81-ad00-09dd8d439885]
aws_cloudwatch_log_group.slow_log: Refreshing state... [id=/elasticache/app-4-redis-cluster/slow-log]
aws_kms_alias.encryption_rest: Refreshing state... [id=alias/elasticache-app-4-at-rest]
data.aws_ami.amazon_ami: Read complete after 0s [id=ami-0ec5c7d8262c1f6b2]
aws_secretsmanager_secret_version.auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-4-elasticache-auth-wx4d1f|84D33659-CAB0-42CE-8BDF-263E487A161A]
aws_iam_policy.secret_manager_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-4-secret-read-policy]
aws_iam_role_policy_attachment.secret_policy_attachement: Refreshing state... [id=app-4-ec2-role-20231211171356808300000001]
aws_default_security_group.default: Refreshing state... [id=sg-00c03a331f28bdf4b]
aws_subnet.private[0]: Refreshing state... [id=subnet-084342d3ba201bfe9]
aws_security_group.elasticache: Refreshing state... [id=sg-0ebe81ff83e813eb8]
aws_route_table.private[2]: Refreshing state... [id=rtb-06b80b26b777a5f0a]
aws_subnet.private[1]: Refreshing state... [id=subnet-0759d81f1c345a0dd]
aws_subnet.public[0]: Refreshing state... [id=subnet-0c3049a8821bcc98c]
aws_route_table.private[0]: Refreshing state... [id=rtb-05fb632dd9719cf47]
aws_subnet.private[2]: Refreshing state... [id=subnet-0de88a416123a72f0]
aws_route_table.private[1]: Refreshing state... [id=rtb-0c66cf1b03f5a174e]
aws_route_table.public: Refreshing state... [id=rtb-0a9a56bbaa9f1abf8]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e68440089e90f44b]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e8da7db97d33f32a]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e696b9622482b55e]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05a15917877c2e011]
aws_elasticache_subnet_group.elasticache_subnet: Refreshing state... [id=app-4-cache-subnet]
aws_elasticache_replication_group.app4: Refreshing state... [id=app-4-redis-cluster]
aws_ssm_parameter.elasticache_ep: Refreshing state... [id=/elasticache/app-4/app-4-redis-cluster/endpoint]
aws_ssm_parameter.elasticache_port: Refreshing state... [id=/elasticache/app-4/app-4-redis-cluster/port]
aws_iam_policy.ssm_parameter_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-4-ssm-parameter-read-policy]
aws_iam_role_policy_attachment.ssm_policy_attachement: Refreshing state... [id=app-4-ec2-role-20231211171356982800000003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.app-server-read will be created
  + resource "aws_instance" "app-server-read" {
      + ami                                  = "ami-0ec5c7d8262c1f6b2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = true
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "app-4-ec2-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0c3049a8821bcc98c"
      + tags                                 = {
          + "Name" = "app-4-server-read"
        }
      + tags_all                             = {
          + "Name"   = "app-4-server-read"
          + "Source" = "https://github.com/kunduso/amazon-elasticache-redis-tf"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "3bdca51f907da8d56aa6517b515e0e33153f53cd"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.app-server-write will be created
  + resource "aws_instance" "app-server-write" {
      + ami                                  = "ami-0ec5c7d8262c1f6b2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = true
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "app-4-ec2-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0c3049a8821bcc98c"
      + tags                                 = {
          + "Name" = "app-4-server-write"
        }
      + tags_all                             = {
          + "Name"   = "app-4-server-write"
          + "Source" = "https://github.com/kunduso/amazon-elasticache-redis-tf"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "9a9c6823af09d9396fdd63d1f6328e39dd9d034f"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.this-igw will be created
  + resource "aws_internet_gateway" "this-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "app-4-gateway"
        }
      + tags_all = {
          + "Name"   = "app-4-gateway"
          + "Source" = "https://github.com/kunduso/amazon-elasticache-redis-tf"
        }
      + vpc_id   = "vpc-01de06becdba1d3e3"
    }

  # aws_route.internet-route will be created
  + resource "aws_route" "internet-route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0a9a56bbaa9f1abf8"
      + state                  = (known after apply)
    }

  # aws_security_group.ec2_instance will be created
  + resource "aws_security_group" "ec2_instance" {
      + arn                    = (known after apply)
      + description            = "Allow inbound to and outbound access from the Amazon EC2 instance."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Enable access to the internet."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.20.32.0/25",
                ]
              + description      = "Enable access from any resource inside the VPC."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "app-4-ec2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Source" = "https://github.com/kunduso/amazon-elasticache-redis-tf"
        }
      + vpc_id                 = "vpc-01de06becdba1d3e3"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*